package kanaconv

import (
	"testing"

	"github.com/stretchr/testify/assert"
)

func TestConvertAllKana(t *testing.T) {
	cases := []string{
		// hiragana
		"あ", "い", "う", "え", "お",
		"ぁ", "ぃ", "ぅ", "ぇ", "ぉ", "ゕ", "ゖ", "っ", "ゃ", "ゅ", "ょ", "ゎ",
		"か", "き", "く", "け", "こ",
		"が", "ぎ", "ぐ", "げ", "ご",
		"さ", "し", "す", "せ", "そ",
		"ざ", "じ", "ず", "ぜ", "ぞ",
		"た", "ち", "つ", "て", "と",
		"だ", "ぢ", "づ", "で", "ど",
		"な", "に", "ぬ", "ね", "の",
		"は", "ひ", "ふ", "へ", "ほ",
		"ば", "び", "ぷ", "ぺ", "ぼ",
		"ぱ", "ぴ", "ぶ", "べ", "ぽ",
		"ま", "み", "む", "め", "も",
		"や", "ゆ", "よ",
		"ら", "り", "る", "れ", "ろ",
		"わ", "ゐ", "ゑ", "を",
		"ん", "ゔ",
		// katakana
		"ア", "イ", "ウ", "エ", "オ",
		"ァ", "ィ", "ゥ", "ェ", "ォ", "ヵ", "ヶ", "ッ", "ャ", "ュ", "ョ", "ヮ",
		"カ", "キ", "ク", "ケ", "コ",
		"ガ", "ギ", "グ", "ゲ", "ゴ",
		"サ", "シ", "ス", "セ", "ソ",
		"ザ", "ジ", "ズ", "ゼ", "ゾ",
		"タ", "チ", "ツ", "テ", "ト",
		"ダ", "ヂ", "ヅ", "デ", "ド",
		"ナ", "ニ", "ヌ", "ネ", "ノ",
		"ハ", "ヒ", "フ", "ヘ", "ホ",
		"バ", "ビ", "ブ", "ベ", "ボ",
		"パ", "ピ", "プ", "ペ", "ポ",
		"マ", "ミ", "ム", "メ", "モ",
		"ヤ", "ユ", "ヨ",
		"ラ", "リ", "ル", "レ", "ロ",
		"ワ", "ヰ", "ヱ", "ヲ",
		"ヷ", "ヸ", "ヹ", "ヺ",
		"ン", "ヴ",
		"・", "ー",
	}

	for _, v := range cases {
		bytes := []byte(v)

		res := string(getKanaRune(bytes[0], bytes[1], bytes[2]))
		assert.Equal(t, v, res)
	}
}
